[
  {
    "title": "Gates Cambridge Scholarship",
    "type": "Scholarship",
    "description": "The Gates Cambridge Scholarship offers full-cost scholarships to outstanding applicants from countries outside the UK to pursue a full-time postgraduate degree at the University of Cambridge. It focuses on academic excellence, leadership potential, and a commitment to improving the lives of others.",
    "requirements": "Applicants must be non-UK citizens applying for a full-time postgraduate degree at the University of Cambridge. Strong academic record, leadership ability, and a commitment to social improvement are essential.",
    "deadline": "10-09-2025",
    "provider": "University of Cambridge",
    "funding": "Full tuition, stipend, travel, and visa costs",
    "link": "https://www.gatescambridge.org/",
    "saved_at": "2025-10-30T16:00:00",
    "id": 2
  },
  {
    "title": "Fulbright Foreign Student Program - Master's in Data Science",
    "type": "Scholarship",
    "description": "The Fulbright Foreign Student Program enables graduate students, young professionals and artists from abroad to study and conduct research in the United States. The Program funds over 4,000 foreign students each year to pursue master's or doctoral degree programs at U.S. universities.\n\nThis scholarship covers full tuition, living expenses, health insurance, and round-trip airfare for study in the United States. Recipients join a diverse cohort of emerging leaders from around the world and gain access to the Fulbright alumni network of over 400,000 individuals worldwide.\n\nThe program emphasizes leadership development, cultural exchange, and building lasting connections between the United States and other countries. Students participate in enrichment activities including conferences, cultural events, and community service opportunities.\n\nPriority fields include STEM subjects, particularly those addressing global challenges such as climate change, public health, food security, and sustainable developmen\n",
    "requirements": "This scholarship covers full tuition, living expenses, health insurance, and round-trip airfare for study in the United States. Recipients join a diverse cohort of emerging leaders from around the world and gain access to the Fulbright alumni network of over 400,000 individuals worldwide.\n",
    "deadline": "12-09-2026",
    "provider": null,
    "funding": "500",
    "link": "https://foreign.fulbrightonline.org/about/foreign-student-program",
    "saved_at": "2025-10-05T16:44:53.527602",
    "id": 1
  },
  {
    "title": "Schwarzman Scholars Program",
    "type": "Scholarship",
    "description": "A fully-funded, one-year master's program at Tsinghua University in Beijing designed to prepare future global leaders. Students pursue studies in Global Affairs with concentrations in Public Policy, Economics, or International Studies.",
    "requirements": "Bachelor’s degree or equivalent, strong leadership potential, English proficiency. Open to all nationalities under 29 years old at the time of enrollment.",
    "deadline": "05-09-2025",
    "provider": "Tsinghua University",
    "funding": "Full tuition, room and board, in-country travel, stipend, and airfare",
    "link": "https://www.schwarzmanscholars.org/",
    "saved_at": "2025-10-30T16:00:00",
    "id": 3
  },
  {
    "title": "Chevening Scholarship",
    "type": "Scholarship",
    "description": "The UK Government’s global scholarship program offers fully funded one-year master’s degrees at any UK university for outstanding emerging leaders from around the world.",
    "requirements": "Applicants must be citizens of Chevening-eligible countries, hold an undergraduate degree, and have at least two years of work experience. Return home for a minimum of two years after the award.",
    "deadline": "11-07-2025",
    "provider": "UK Foreign, Commonwealth & Development Office (FCDO)",
    "funding": "Full tuition, living allowance, return flights, and visa fees",
    "link": "https://www.chevening.org/",
    "saved_at": "2025-10-30T16:00:00",
    "id": 4
  },
  {
    "title": "Erasmus Mundus Joint Master’s Scholarships",
    "type": "Scholarship",
    "description": "A prestigious, fully funded European Union program supporting international students to pursue joint master’s degrees offered by consortia of European universities in multiple countries.",
    "requirements": "Applicants must hold a bachelor’s degree and apply to a selected Erasmus Mundus Joint Master’s program. Open to all nationalities.",
    "deadline": "02-01-2026",
    "provider": "European Commission",
    "funding": "Full tuition, travel, installation allowance, and monthly stipend",
    "link": "https://www.eacea.ec.europa.eu/scholarships/erasmus-mundus_en",
    "saved_at": "2025-10-30T16:00:00",
    "id": 5
  },
  {
    "title": "DAAD Helmut Schmidt Programme – Public Policy and Good Governance",
    "type": "Scholarship",
    "description": "The DAAD Helmut Schmidt Programme offers full scholarships for master’s programs in public policy, governance, and development at German universities. It targets future leaders committed to social justice and good governance.",
    "requirements": "Bachelor’s degree, proven experience in social/political engagement, and strong motivation for public service. Open to graduates from developing and transition countries.",
    "deadline": "07-31-2025",
    "provider": "DAAD (German Academic Exchange Service)",
    "funding": "Full tuition, monthly stipend, travel allowance, and health insurance",
    "link": "https://www.daad.de/en/study-and-research-in-germany/scholarships/helmut-schmidt-programme/",
    "saved_at": "2025-10-30T16:00:00",
    "id": 6
  },
  {
    "title": "Knight-Hennessy Scholars Program",
    "type": "Scholarship",
    "description": "Knight-Hennessy Scholars is a fully funded graduate-level scholarship at Stanford University, supporting students from all disciplines who demonstrate leadership, innovation, and civic commitment.",
    "requirements": "Applicants must apply to a full-time graduate program at Stanford and separately to the Knight-Hennessy Scholars program. All nationalities eligible.",
    "deadline": "10-09-2025",
    "provider": "Stanford University",
    "funding": "Full tuition, living stipend, and travel allowance",
    "link": "https://knight-hennessy.stanford.edu/",
    "saved_at": "2025-10-30T16:00:00",
    "id": 7
  },
  {
    "title": "Aga Khan Foundation International Scholarship Programme",
    "type": "Scholarship",
    "description": "The Aga Khan Foundation provides limited numbers of scholarships each year for postgraduate studies to outstanding students from developing countries who have no other means of financing their education.",
    "requirements": "Excellent academic record, genuine financial need, and admission to a reputable postgraduate program. Preference for students under 30 years old.",
    "deadline": "03-31-2026",
    "provider": "Aga Khan Foundation",
    "funding": "50% grant and 50% loan for tuition and living expenses",
    "link": "https://www.akdn.org/our-agencies/aga-khan-foundation/international-scholarship-programme",
    "saved_at": "2025-10-30T16:00:00",
    "id": 8
  },
  {
    "title": "Rotary Peace Fellowship",
    "type": "Fellowship",
    "description": "The Rotary Peace Fellowship funds master’s degree programs related to peace and development at leading universities worldwide. Fellows develop practical skills to promote peace and resolve conflict globally.",
    "requirements": "Bachelor’s degree, minimum three years of relevant work experience, and a strong commitment to peace and international understanding.",
    "deadline": "05-15-2026",
    "provider": "Rotary International",
    "funding": "Full tuition, room and board, transportation, and internship expenses",
    "link": "https://www.rotary.org/en/our-programs/peace-fellowships",
    "saved_at": "2025-10-30T16:00:00",
    "id": 9
  },
  {
    "title": "Swedish Institute Scholarships for Global Professionals (SISGP)",
    "type": "Scholarship",
    "description": "The Swedish Institute offers full scholarships for global professionals to study master’s programs in Sweden. It targets future leaders contributing to sustainable development in their home countries.",
    "requirements": "Applicants must be from eligible countries, have work experience, and demonstrate leadership and motivation for sustainable development.",
    "deadline": "02-28-2026",
    "provider": "Swedish Institute",
    "funding": "Full tuition, living expenses, insurance, and travel grant",
    "link": "https://si.se/en/apply/scholarships/swedish-institute-scholarships-for-global-professionals/",
    "saved_at": "2025-10-30T16:00:00",
    "id": 10
  },
  {
    "title": "Clarendon Fund Scholarship – University of Oxford",
    "type": "Scholarship",
    "description": "The Clarendon Fund offers over 150 full scholarships annually for graduate students at the University of Oxford. It covers any subject area and recognizes academic excellence and leadership potential.",
    "requirements": "Apply for a graduate degree at Oxford by the relevant January deadline. Selection is based on academic merit and potential.",
    "deadline": "01-22-2026",
    "provider": "University of Oxford",
    "funding": "Full tuition and generous living allowance",
    "link": "https://www.ox.ac.uk/clarendon",
    "saved_at": "2025-10-30T16:00:00",
    "id": 11
  },
  {
    "title": "منحة جامعة فيينا 2025",
    "type": "Scholarship",
    "description": "منحة جامعة فيينا تُعد فرصة مميزة للطلاب الدوليين الراغبين في متابعة دراستهم الجامعية أو العليا في النمسا. تقدم الجامعة مجموعة من المنح التي تشمل إعفاءات من الرسوم الدراسية ومزايا إضافية تهدف إلى دعم الطلاب الأكاديميين وتخفيف الأعباء المالية عنهم.",
    "requirements": "يجب على المتقدمين استيفاء الشروط التالية: أن يكون المتقدم مسجلاً أو حاصلاً على قبول في برنامج بكالوريوس، ماجستير أو دكتوراه في جامعة فيينا، أن يمتلك سجلًا أكاديميًا جيدًا وكشف درجات حديث يثبت الأداء الدراسي، تقديم سيرة ذاتية محدثة ورسالة دافع توضح أهداف المتقدم من الدراسة، إتقان اللغة الإنجليزية أو الألمانية وفقًا لمتطلبات البرنامج الدراسي، أن يكون المتقدم من طلاب الجامعات الشريكة أو ممن يحصلون على دعم حكومي دراسي (في بعض البرامج)، تقديم نسخ من الشهادات الأكاديمية وجواز السفر أو الهوية الرسمية.",
    "deadline": null,
    "provider": "جامعة فيينا",
    "funding": "تمويل جزئي أو كامل بحسب البرنامج، تشمل إعفاءً من الرسوم الدراسية أو دعماً لتكاليف المعيشة والسفر.",
    "location": "النمسا",
    "link": "https://scholarfox.com/opportunities/austria-3524/",
    "saved_at": "2025-11-01T17:21:41.641718",
    "id": 12
  },
  {
    "title": "Graduate Programme – United Nations Development Programme (UNDP)",
    "type": "Job/Placement Programme",
    "description": "The Graduate Programme offers young graduates a 2-year assignment with UNDP country, regional or headquarters offices to build a talent pipeline for international development. :contentReference[oaicite:3]{index=3}",
    "requirements": "Recent graduates from UNDP programme countries; diverse studies; willingness to deploy internationally.",
    "deadline": "Various yearly",
    "provider": "UNDP",
    "funding": "Full salary & benefits (staff appointment)",
    "link": "https://www.undp.org/careers/undp-graduate-programme",
    "saved_at": "2025-11-01T00:00:00",
    "id": 13
  },
  {
    "title": "Junior Professional Officer (JPO) Programme – United Nations Children’s Fund (UNICEF)",
    "type": "Job/Placement Programme",
    "description": "The JPO Programme provides young professionals with hands-on experience at UNICEF; many continue into full-staff roles. :contentReference[oaicite:5]{index=5}",
    "requirements": "Advanced university degree; 2+ years relevant experience; often donor country nationals, but some developing country nationals eligible.",
    "deadline": "Varies by donor country",
    "provider": "UNICEF",
    "funding": "Fixed-term staff salary & benefits",
    "link": "https://www.unicef.org/careers/junior-professional-officer-programme",
    "saved_at": "2025-11-01T00:00:00",
    "id": 14
  },
  {
    "title": "International Professionals Programme (IPP) – European Bank for Reconstruction and Development (EBRD)",
    "type": "Job/Placement Programme",
    "description": "A 24-month immersive programme for high-calibre graduates at EBRD providing rotations and international exposure in its countries of operations. :contentReference[oaicite:7]{index=7}",
    "requirements": "Graduates with excellent academic record; mobility; interest in emerging markets.",
    "deadline": "Annual cycle",
    "provider": "EBRD",
    "funding": "Salary & benefits (employment)",
    "link": "https://www.ebrd.com/home/work-with-us/ebrd-careers/international-professionals-programme.html",
    "saved_at": "2025-11-01T00:00:00",
    "id": 15
  },
  {
    "title": "Professional Fellows Program – U.S. Department of State Exchange Program",
    "type": "Job/Placement Programme",
    "description": "A global exchange programme for mid-level emerging leaders (ages 25-40) offering 5-6 week fellowships in U.S. non-profits, private and public sectors. :contentReference[oaicite:9]{index=9}",
    "requirements": "2+ years professional experience; leadership potential; English proficiency; citizenship of eligible country.",
    "deadline": "Oct-Nov & Feb-Mar cycles",
    "provider": "U.S. Department of State",
    "funding": "Stipend, some expenses covered",
    "link": "https://exchanges.state.gov/non-us/program/professional-fellows-program",
    "saved_at": "2025-11-01T00:00:00",
    "id": 16
  },
  {
    "title": "Global Operations Leadership Development (GOLD) Programme – Johnson & Johnson",
    "type": "Job/Placement Programme",
    "description": "A 2.5-year rotational full-time employment programme combining work rotations, training, global exposure in supply chain, operations and manufacturing. :contentReference[oaicite:11]{index=11}",
    "requirements": "Bachelor’s in relevant field; 4+ months experience; leadership potential; interest in global supply chain/operations.",
    "deadline": "Annual intake",
    "provider": "Johnson & Johnson",
    "funding": "Full salary & benefits (employment)",
    "link": "https://careers.jnj.com/en/student-opportunities/leadership-development-programs/global-operations-leadership-development-program/",
    "saved_at": "2025-11-01T00:00:00",
    "id": 17
  },
  {
    "title": "International Leadership Trainee Program – Coca‑Cola HBC",
    "type": "Job/Placement Programme",
    "description": "An elite 18-24 month programme designed to prepare future global leaders in commercial functions, combining real projects, academic partner learning, and mentorship. :contentReference[oaicite:13]{index=13}",
    "requirements": "Top talent early-career; readiness for mobility; academic excellence; leadership mindset.",
    "deadline": "Next cohort April 2026",
    "provider": "Coca-Cola HBC",
    "funding": "Salary & benefits (employment)",
    "link": "https://www.coca-colahellenic.com/en/working-with-us/international-leadership-trainee-program",
    "saved_at": "2025-11-01T00:00000",
    "id": 18
  },
  {
    "title": "Young Professional Development Programme – OPEC Fund for International Development (YPDP)",
    "type": "Job/Placement Programme",
    "description": "A two-year programme preparing young professionals for careers in global development, with training, coaching and mentoring. :contentReference[oaicite:15]{index=15}",
    "requirements": "Recent graduates or early-career professionals; interest in development finance; global mobility.",
    "deadline": "Annual cycle",
    "provider": "OPEC Fund",
    "funding": "Salary & benefits (employment)",
    "link": "https://opecfund.org/career-opportunities/young-professional-development-program",
    "saved_at": "2025-11-01T00:00:00",
    "id": 19
  },
  {
    "title": "Leadership Fellow Programme – The Partnership Inc.",
    "type": "Job/Placement Programme",
    "description": "Designed for professionals and managers with more than five years’ experience to accelerate into leadership roles through coaching, experiential learning and network development. :contentReference[oaicite:17]{index=17}",
    "requirements": "Mid-career professionals (5+ years); leadership ambition; diverse backgrounds.",
    "deadline": "Rolling intake",
    "provider": "The Partnership Inc.",
    "funding": "Programme fee (sometimes employer-sponsored)",
    "link": "https://www.thepartnershipinc.org/fellows-leadership-development-program/",
    "saved_at": "2025-11-01T00:00:00",
    "id": 20
  },
  {
    "title": "Leadership Development Program – The Port Authority of New York & New Jersey",
    "type": "Job/Placement Programme",
    "description": "A two-year rotational programme for graduate degree holders leading to full-time employment, with rotations across multiple business functions. :contentReference[oaicite:19]{index=19}",
    "requirements": "Graduate degree between Dec 2025 and June 2026; interest in multi-function rotation; leadership potential.",
    "deadline": "Recruitment now for 2026 intake",
    "provider": "Port Authority of NY & NJ",
    "funding": "Salary & benefits (employment)",
    "link": "https://www.jointheportauthority.com/jobs/16608170-2026-leadership-fellow-program",
    "saved_at": "2025-11-01T00:00:00",
    "id": 21
  },
  {
    "title": "Global Leadership Fellows Programme – Eisenhower Fellowships",
    "type": "Professional Development Programme",
    "description": "Identifies, empowers and connects innovative global leaders through a transformative fellowship experience and lifelong network. :contentReference[oaicite:21]{index=21}",
    "requirements": "Established leaders with track record of impact; international mobility; commitment to global challenges.",
    "deadline": "Annual cohort",
    "provider": "Eisenhower Fellowships",
    "funding": "Fellowship award + travel + network engagement",
    "link": "https://www.efworld.org/fellowship-programs/international-programs/",
    "saved_at": "2025-11-01T00:00:00",
    "id": 22
  },
  {
    "title": "Global Leadership Fellows Programme – Cornell University Emerging Markets Institute",
    "type": "Professional Development Programme",
    "description": "Convokes visionary leaders with international careers to coach, teach, and collaborate across business, consulting, finance and technology. :contentReference[oaicite:23]{index=23}",
    "requirements": "Senior executives or experienced leaders; global business acumen; mentorship capability.",
    "deadline": "Refer to institute website",
    "provider": "Cornell EMI",
    "funding": "Honorarium / fellowship status",
    "link": "https://business.cornell.edu/centers/emi/fellows/global-leadership-fellows-program/",
    "saved_at": "2025-11-01T00:00:00",
    "id": 23
  },
  {
    "title": "Global Leadership Fellows – World Economic Forum (GLF)",
    "type": "Professional Development Programme",
    "description": "A programme combining academic inspiration, on-the-job training through the Forum’s engagement with global challenges. :contentReference[oaicite:25]{index=25}",
    "requirements": "High-potential leaders; ability to engage in global challenge settings; cross-sector experience.",
    "deadline": "Cohort based",
    "provider": "World Economic Forum",
    "funding": "Fellowship award + network access",
    "link": "https://www3.weforum.org/docs/WEF_GLF%20Brochure.pdf",
    "saved_at": "2025-11-01T00:00:00",
    "id": 24
  },
  {
    "title": "Global Program Fellows Internship – International House Chicago",
    "type": "Professional Development Programme",
    "description": "Selects outstanding graduate students globally to serve as interns in program-design roles at I-House, engaging events, communications and global community building. :contentReference[oaicite:27]{index=27}",
    "requirements": "Graduate student; global perspective; interest in programming & community development.",
    "deadline": "Applications closed for 2025–26 but upcoming cycle",
    "provider": "International House Chicago",
    "funding": "Stipend + housing assistance",
    "link": "https://ihouse.uchicago.edu/fellowships/global_program_fellows_internship_program/",
    "saved_at": "2025-11-01T00:00:00",
    "id": 25
  },
  {
    "title": "Global Fellows in Washington DC – University of Maryland",
    "type": "Professional Development Programme",
    "description": "An innovative programme for undergraduates combining classroom, professional experience and international policy immersion in Washington DC. :contentReference[oaicite:29]{index=29}",
    "requirements": "Undergraduate with strong academic record; interest in global issues, policy & development.",
    "deadline": "Annual intake",
    "provider": "University of Maryland",
    "funding": "Seminar + internship placement",
    "link": "https://www.globalfellowsdc.umd.edu/overview.html",
    "saved_at": "2025-11-01T00:00:00",
    "id": 26
  },
  {
    "title": "Global Leadership Fellows – Villanova University School of Business",
    "type": "Professional Development Programme",
    "description": "A certificate-programme embedding global leadership study, international experience and mentorship within the business school curriculum. :contentReference[oaicite:31]{index=31}",
    "requirements": "Undergraduate business students; commitment to global study and leadership development.",
    "deadline": "Refer to institution",
    "provider": "Villanova University School of Business",
    "funding": "Certificate programme (tuition may apply)",
    "link": "https://live-villanova-catalog.cleancatalog.io/global-leadership-fellows-program/global-leadership-fellows-program",
    "saved_at": "2025-11-01T00:00:00",
    "id": 27
  },
  {
    "title": "Internships & Programmes – Atlantic Council Young Global Professionals (YGP)",
    "type": "Professional Development Programme",
    "description": "Paid internships and Young Global Professionals programme at Atlantic Council combining foreign-policy research, editorial work, masterclasses, career development. :contentReference[oaicite:33]{index=33}",
    "requirements": "Early-career professionals; interest in international affairs; analytical/communications skills.",
    "deadline": "Cohorts spring & fall",
    "provider": "Atlantic Council",
    "funding": "Paid internship or fellowship stipend",
    "link": "https://www.atlanticcouncil.org/careers/internships/",
    "saved_at": "2025-11-01T00:00:00",
    "id": 28
  },
  {
    "title": "Professional Fellows Programme – Ford Foundation Global Fellowship",
    "type": "Professional Development Programme",
    "description": "A major investment to connect and support the next generation of leaders from around the world. :contentReference[oaicite:35]{index=35}",
    "requirements": "Leaders from developing countries with record of impact; global network potential; innovation mindset.",
    "deadline": "10-year initiative ongoing",
    "provider": "Ford Foundation",
    "funding": "Fellowship award + leadership support",
    "link": "https://www.fordfoundation.org/work/investing-in-individuals/the-ford-global-fellowship/",
    "saved_at": "2025-11-01T00:00:00",
    "id": 29
  },
  {
    "title": "Global Program Internship – CIEE Douglass-O’Connell Global Internship",
    "type": "Professional Development Programme",
    "description": "An 8-week fully-sponsored summer internship in Dublin combining lectures on social change, Irish business culture and a work placement. :contentReference[oaicite:37]{index=37}",
    "requirements": "Undergraduate freshman-junior; min GPA 3.0; US citizen/permanent resident; Pell-Grant eligible.",
    "deadline": "January 9, 2026",
    "provider": "CIEE",
    "funding": "Airfare, housing, academic course, stipend",
    "link": "https://www.ciee.org/go-abroad/college-study-abroad/scholarships/douglass-oconnell-global-internship",
    "saved_at": "2025-11-01T00:00:00",
    "id": 30
  },
  {
    "title": "Global Leadership Fellowship – Kettering Foundation Charles F. Kettering Global Fellowship",
    "type": "Professional Development Programme",
    "description": "Brings together international leaders from academia, civil society and journalism to support democracy and global leadership. :contentReference[oaicite:39]{index=39}",
    "requirements": "Established professionals with leadership in democracy/civil society; global experience.",
    "deadline": "Annual selection",
    "provider": "Kettering Foundation",
    "funding": "Fellowship award + network",
    "link": "https://www.kettering.org/fellowships",
    "saved_at": "2025-11-01T00:00:00",
    "id": 31
  }
]